# FasciaDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofBase..::..FasciaDepth Property
RoofBase Class See Also
---
Retrieve or set the FasciaDepth.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double FasciaDepth { get; set; }
```

Visual Basic
---
```text
Public Property FasciaDepth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double FasciaDepth {
	double get ();
	void set (double value);
}
```

# Remarks
If the EaveCutterType is PlumbCut, this property doesn't make sense.
# See Also
RoofBase Class
Autodesk.Revit.DB Namespace